{
  "general": {
    "appName": "מחולל סיסמאות",
    "privacyPolicy": "מדיניות הפרטיות",
    "aboutApp": "על האפליקציה",
    "aboutUs": "עלינו",
    "version": "גרסה: {{version}}"
  },
  "home": {
    "subTitle": "הזן שתי מילות מפתח כדי ליצור סיסמה חזקה.\n עבור שתי המילים הללו תקבל את אותה סיסמה.",
    "note": "שימו לב, אנא זכרו שלא ניתן לשחזר את מילות המפתח במקרה של שכחה.",
    "Keyword1Title": "מילת מפתח 1",
    "Keyword2Title": "מילת מפתח 2",
    "inputPlaceholder": "הקלד את מילת המפתח שלך"
  },
  "hub": {
    "veryWeakTitle": "מספרים בלבד",
    "weakTitle": "אותיות בלבד",
    "mediumTitle": "מספרים ואותיות",
    "strongTitle": "כולל אותיות גדולות",
    "veryStrongTitle": "כולל סימן"
  },
  "menu": {
    "shareApp": "שתף את האפליקציה",
    "securityKey": "מפתח אבטחה",
    "settings": "הגדרות",
    "darkMode": "מצב כהה",
    "language": "שפה",
    "privacyNotice": "באמצעות שימוש באפליקציה זו, אתה מסכים ל[link1] שלנו"
  },
  "privacyPolicy": {
    "lastUpdate": {
      "description": "עדכון אחרון: ",
      "details": "2023-09-21"
    },
    "owner": "אביתר חזן מפעיל את אפליקציית Password-Generator לנייד ('האפליקציה').",
    "appName": "Password-Generator",
    "dataCollection": {
      "description": "ללא איסוף נתונים:",
      "details": "האפליקציה Password-Generator אינה אוספת, מאחסנת או משתפת מידע אישי או נתונים מהמשתמשים שלה. איננו אוספים מידע על קלט משתמש, סיסמאות שנוצרו או כל מידע ספציפי למכשיר."
    },
    "accountCreation": {
      "description": "ללא יצירת חשבון:",
      "details": "אפליקציית Password-Generator אינה מחייבת משתמשים ליצור חשבונות או לספק צורת רישום כלשהי."
    },
    "internetConnection": {
      "description": "ללא חיבור לאינטרנט:",
      "details": "אפליקציית Password-Generator אינה דורשת חיבור לאינטרנט כדי לתפקד. היא פועלת במצב לא מקוון לחלוטין ואינה מתקשרת עם שרתים או שירותים חיצוניים."
    },
    "advertising": {
      "description": "פרסום:",
      "details": "אפליקציית Password-Generator עשויה להציג פרסומות של צד שלישי. מודעות אלו עשויות לאסוף נתונים בהתאם למדיניות הפרטיות של ספקי הפרסום. עם זאת, אין לנו גישה או שליטה על הנתונים שנאספים על ידי צד שלישי או מפרסמים צדדים."
    },
    "security": {
      "description": "אבטחה:",
      "details": "אנו מתייחסים ברצינות לפרטיות המשתמש ואבטחת הנתונים. בעוד שהאפליקציה אינה אוספת נתוני משתמשים, אנו מיישמים אמצעי אבטחה כדי להגן מפני גישה, שימוש או חשיפה בלתי מורשית של כל מידע שלא נאסף."
    },
    "childrenPrivacy": {
      "description": "פרטיות הילדים:",
      "details": "אפליקציית Password-Generator אינה מיועדת לשימוש על ידי ילדים מתחת לגיל 13. איננו אוספים ביודעין מידע אישי מילדים מתחת לגיל 13. אם אתה הורה או אפוטרופוס ומאמין כי הילד שלך סיפק לנו מידע אישי, אנא צור איתנו קשר, ואנו נמחק מידע כזה מהרישומים שלנו."
    },
    "changes": {
      "description": "שינויים במדיניות הפרטיות הזו:",
      "details": "אנו עשויים לעדכן את מדיניות הפרטיות שלנו מעת לעת. מומלץ לעיין במדיניות פרטיות זו מעת לעת עבור כל שינוי. שינויים במדיניות פרטיות זו תקפים כאשר הם מתפרסמים בקישור למטה."
    },
    "contact": {
      "description": "צור קשר:",
      "details": "אם יש לך שאלות או חששות לגבי מדיניות פרטיות זו, אנא צור איתנו קשר בכתובת: [link1]",
      "email": "mailto:evyatar.hazan3.14@gmail.com",
      "emailName": "מייל"
    },
    "sourceDocument": {
      "description": "למסמך המקור, בקר ב [link1]",
      "link": "https://docs.google.com/document/d/14S4NDZgweh8Iin8ILHM1xWVVNOqVZ0XlfDtiVYTinSQ/edit?usp=sharing"
    }
  },
  "aboutApp": {
    "gettingStarted": {
      "title": "תחילת העבודה:",
      "personalWord": {
        "description": "1. הזן את המילה האישית שלך:",
        "details": "תחשוב על מילה או ביטוי שהם אישיים עבורך, משהו שרק אתה היית יודע. מילה זו תהיה הבסיס לסיסמה שלך ויש לשמור בסוד."
      },
      "platformWord": {
        "description": "2. הזן מילה ספציפית לפלטפורמה:",
        "details": "חשוב על מילה הקשורה לפלטפורמה או לשירות שעבורם אתה צריך את הסיסמה. לדוגמה, אם אתה יוצר סיסמה לבנק שלך, השתמש במילה הקשורה לבנקאות. זה מוסיף שכבת אבטחה נוספת והופך את הסיסמה שלך לייחודית לכל פלטפורמה."
      }
    },
    "exampleUsage": {
      "title": "שימוש לדוגמה:",
      "personalWord": {
        "description": "מילה אישית:",
        "details": "'Avraham'"
      },
      "platformWord": {
        "description": "מילת פלטפורמה:",
        "details": "'Bank'"
      }
    },
    "generatedPasswords": {
      "title": "סיסמאות שנוצרו:"
    },
    "securityTips": {
      "title": "טיפים לאבטחה:",
      "secret": {
        "description": "● שמור את המילה האישית שלך בסוד:",
        "details": "אל תשתף את המילה האישית שבה אתה משתמש עם אף אחד. היא המפתח ליצירת הסיסמאות הייחודיות שלך."
      },
      "obvious": {
        "description": "● הימנע משימוש במילות פלטפורמה ברורות:",
        "details": "בחר מילים ספציפיות לפלטפורמה שלא ניתן לנחש בקלות על ידי אחרים."
      },
      "securityNeeds": {
        "description": "● בחר באפשרות הסיסמה המתאימה לצרכי האבטחה שלך:",
        "details": "בהתאם לרגישות החשבון, בחר באפשרות הסיסמה שנוצרה המתאימה ביותר לדרישות האבטחה שלך."
      }
    },
    "importantNote": {
      "title": "הערה חשובה:",
      "Note": {
        "details": "הסיסמאות שנוצרות שלך אינן מאוחסנות בשום מקום בתוך Password-Generator. הן נוצרות תוך כדי תנועה בהתבסס על הקלט שלך ואינן נגישות לאף אחד, מה שמבטיח את האבטחה והפרטיות שלך."
      },
      "thanks": {
        "details": "תודה שבחרת ב- Password-Generator! האבטחה המקוונת שלך היא בראש סדר העדיפויות שלנו. אם יש לך שאלות או חששות, אל תהסס לפנות לצוות התמיכה שלנו."
      }
    }
  },
  "aboutUs": {
    "welcome": {
      "description": "ברוכים הבאים ל- Password-Generator!",
      "details": "שלום לך! אני אביתר חזן, המוח מאחורי מחולל הסיסמאות. תענוג לארח אותך כאן, ואני נרגש לחלוק את הסיפור של איך ה- Password-Generator יצא לפועל."
    },
    "inspiration": {
      "description": "השראה:",
      "details": "כמו רבים מכם, אני דאגתי מאוד לגבי אבטחה מקוונת. הבנתי שאחת הדרכים הפשוטות אך היעילות ביותר להגן על עצמך באינטרנט היא שימוש בסיסמאות חזקות וייחודיות לכל חשבון. עם זאת, גיליתי שאנשים רבים נאבקו ביצירת סיסמאות כאלה. זה נתן לי השראה לפתח את Password-Generator, כלי שמפשט את התהליך של יצירת סיסמאות מאובטחות."
    },
    "developmentJourney": {
      "description": "מסע פיתוח:",
      "details": "המסע ליצירת Password-Generator היה מלא באתגרים ובניצחונות. מחקר אלגוריתמי ההצפנה הטובים ביותר ועד לעיצוב ממשק ידידותי למשתמש, כל שלב היה מלאכת אהבה. למרות המכשולים, הסיפוק מהתרומה לאבטחה מקוונת הפך את הכל לכדאי."
    },
    "featuresAndBenefits": {
      "description": "תכונות ויתרונות:",
      "details": "מחולל סיסמאות הוא לא סתם עוד מחולל סיסמאות מהשורה הראשונה. זהו פתרון חזק שיוצר מתוך מחשבה על פשטות, אבטחה ופרטיות. אחד מעקרונות הליבה שלנו הוא שאנו לעולם לא מאחסנים מידע עליך או על הסיסמאות שלך בשום שלב של התהליך. הפרטיות שלך היא מעל הכל, ואתה יכול לסמוך על Password-Generator שייצור סיסמאות חזקות מבלי לפגוע במידע הרגיש שלך. עם Password-Generator, אתה יכול ליצור ללא מאמץ סיסמאות חזקות המותאמות לדרישות הספציפיות שלך. הכלי שלנו מבטיח שהחשבונות המקוונים שלך יישארו מוגנים מפני גישה לא מורשית, ומעניק לך שקט נפשי."
    },
    "futurePlans": {
      "description": "תוכניות עתידיות: ",
      "details": "בעתיד, אנו גם מתכננים להרחיב את ההיצע שלנו כדי לספק נוחות וגמישות רבה עוד יותר למשתמשים שלנו. אנו מתכוננים להשקת אתר אינטרנט ייעודי ותוסף לכרום עבור מחולל סיסמאות. תוספות אלו ייעלו עוד יותר את תהליך ניהול הסיסמאות, ויאפשרו לך לגשת לכלי שלנו בצורה חלקה על פני פלטפורמות ודפדפנים שונים. המשך לעקוב אחר ההתפתחויות המרגשות הללו!"
    },
    "thankYou": {
      "description": "תודה:",
      "details": "אני רוצה להביע את תודתי מכל הלב לכל אחד ואחת מכם על הבחירה ב- Password-Generator. התמיכה והמשוב שלך מניעים אותנו לשפר ולחדד את הכלי שלנו ללא הרף. תודה מיוחדת ליוצרת הרעיון המקורי, מנדי, על ההשראה לפרויקט זה. התרומה שלך לא יסולא בפז. ביחד, נוכל ליצור סביבה מקוונת בטוחה יותר לכולם."
    },
    "getInTouch": {
      "description": "צור קשר:",
      "details": "צור קשר:  יש לך שאלה או הצעה? אני אשמח לשמוע ממך! אתם מוזמנים ליצור איתי קשר בכתובת [link1] או להתחבר אלי בלינקדאין [link2]. אתה יכול גם להתחבר למנדי בלינקדאין [link3] . הקלט שלך חשוב לאין ערוך בעיצוב העתיד של מחולל סיסמאות.",
      "journey": "תודה שהיית חלק מהמסע שלנו!",
      "warmRegards": "בברכה, אביתר חזן מייסד ומפתח, מחולל סיסמאות",
      "owner": "אביתר חזן",
      "here": "כאן",
      "linkOwner": "https://www.linkedin.com/in/evyatar-hazan-662235210?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=android_app",
      "link": "https://www.linkedin.com/in/mendy-bloy-5671b8276?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=android_app"
    }
  },
  "onboarding": {
    "general": {
      "skip": "דלג",
      "next": "הבא",
      "back": "חזור",
      "done": "סיים",
      "dontShowAgain": "אל תראה שוב"
    },
    "page0": {
      "title": "ברוך הבא למחולל הסיסמאות המאובטח שלך!",
      "subtitle": "צור סיסמאות חזקות בקלות ובבטחה, ללא צורך לזכור אותן."
    },
    "page1": {
      "title": "הסיסמה שלך - בראש שלך!",
      "subtitle": "שכח ממאות סיסמאות מסובכות. כל מה שאתה צריך לזכור זה שתי מילים בלבד."
    },
    "page2": {
      "title": "איך זה עובד?",
      "subtitle": "1. **מילה אישית סודית:** חשוב על מילה או ביטוי שרק אתה יודע. זה יהיה הבסיס הייחודי לסיסמאות שלך.\n\n2. **מילת פלטפורמה:** הזן מילה הקשורה לשירות או לאתר עבורו אתה יוצר סיסמה (לדוגמה, 'פייסבוק', 'בנק', 'אימייל')."
    },
    "page3": {
      "title": "כל רמות האבטחה - במכה אחת!",
      "subtitle": "**האפליקציה מייצרת עבורך באופן מיידי סיסמאות מאובטחות במגוון רמות:**\n• רק מספרים: 1234\n• אותיות בלבד: abcd\n• מספרים ואותיות: a1b2\n• כולל אותיות גדולות: Aa12\n• כולל סימנים מיוחדים: #Aa1\n\nבחר את הסיסמה המתאימה ביותר לצרכים שלך מתוך האפשרויות המוצגות."
    },
    "page4": {
      "title": "למה זה כל כך בטוח?",
      "subtitle": "• **פונקציה חד כיוונית (Hash):** האלגוריתם שלנו מבטיח שאי אפשר לשחזר את המילים שלך מהסיסמה שנוצרה.\n• **מילת אבטחה אישית:** מוסיפה שכבת הגנה נוספת - רק אתה יכול ליצור את הסיסמאות שלך.\n• **פרטיות מובטחת:** אנחנו לא שומרים שום מידע על המילים שלך או על הסיסמאות שנוצרו!"
    },
    "page5": {
      "title": "חשוב לדעת!",
      "subtitle": "**אזהרה קריטית:** מילת האבטחה האישית שלך קריטית לשחזור הסיסמאות.\nאם תמחק את האפליקציה, תאפס את הנתונים או תחליף מכשיר - **לא ניתן יהיה לשחזר את מילת האבטחה והסיסמאות שלך.**\nודא שאתה זוכר היטב את המילה האישית שלך!"
    },
    "page6": {
      "title": "מוכנים להתחיל?",
      "subtitle": "הזן את המילה האישית שלך והתחל ליצור סיסמאות מאובטחות בקלות!"
    }
  }
}
